cheatsheets/uv-cheatsheet.org
:PROPERTIES:
:ID:       b6d2c374-9876-4034-9867-c44af23c5d9a
:END:
#+TITLE: _uv_ cheatsheet
#+TAGS:
#+EMAIL:     aionfork@gmail.com
#+DESCRIPTION: notes
#+OPTIONS: ':nil *:t -:t ::t <:t \n:nil ^:t arch:headline
#+OPTIONS: author:nil c:nil d:(not "LOGBOOK") date:nil
#+OPTIONS: e:t email:nil f:t inline:t num:nil p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:nil todo:t |:t
#+OPTIONS: toc:nil
#+OPTIONS: html-style:link
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="uv-cheatsheet.css" />
# #+BIND: org-html-htmlize-output-type nil
#+SELECT_TAGS:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en


* Roam :noexport:
+ [[id:b4c096ee-6e40-4f34-85a1-7fc901e819f5][Python]]

*  

#+begin_export html
<pre>
#+end_export

#+begin_verse
*add*    *clean*    *export*    *format*    *init*    *lock*     *remove*    *run*    *sync*    *tree*    *venv*

              --project              --directory                --isolated

*pip*               *python*               *tool*                *auth*           *self*

├── check         ├── dir              ├── dir             ├── dir        ├── update                 
├── compile       ├── find             ├── install         ├── login      └── version                
├── freeze        ├── install          ├── list            ├── logout                         
├── install       ├── list             ├── run             └── token      *cache*               
├── list          ├── pin              ├── uninstall                      
├── show          ├── uninstall        ├── update-shell    *workspace*      ├── clean        
├── sync          ├── update-shell     ├── upgrade                        ├── dir          
├── tree          └── upgrade          └── uvx             ├── dir        ├── prune        
└── uninstall                                              └── list       └── size         


*build*   *publish*                                      

*build-backend*                              _Global Options_                   -q --quiet  -v --verbose         

├── build-editable                         --[no-]cache-dir                 --{no,allow}-python-downloads                                                              
├── build-sdist                            --[no-]color {auto,always,never} --python-fetch  {automatic,manual,never}                     
├── build-wheel                            --[no-]config-file               --python-preference ...
├── get-requires-for-build-editable        --[no-]managed-python            --allow-insecure-host                                        
├── get-requires-for-build-sdist        -n --[no-]native-tls                --no-installer-metadata                                      
├── get-requires-for-build-wheel           --[no-]offline                  
├── prepare-metadata-for-build-editable    --[no-]preview                   --show-settings     
└── prepare-metadata-for-build-wheel       --no-progress                    --preview-features  

#+end_verse

#+begin_export html
</pre>
#+end_export

* noexport :noexport:
:PROPERTIES: 
:header-args+: :var obtmp=(or (bound-and-true-p ob@uv_cheatsheet) (setq ob@uv_cheatsheet (make-temp-file "roam-" t)))
:END:

** CSS

#+begin_src css :tangle uv-cheatsheet.css
/* org reset --------------------------------------------- */
body { font-size: 0.9em; margin: 0.1em; padding: 0em }
p { font-size: 0.9em; }
th { background-color: seagreen; color: #F6F6F6; }
table { border: 1px solid darkgreen; border-radius: 3px; }
th,td { border: 1px solid darkgreen; padding: 0.2em; font-size: 0.9em; }
#content { max-width: 100% !important }
code { color: indigo; }
h1,h2,h3,h4,h5 { margin: 0.2em; padding: 0.1em}
ul,ol { margin: 0.1em; }

dd { margin: 0.1em 2em; }
li { margin: 0.1em; }

/* cheatsheet --------------------------------------------- */
table { display: table; margin: auto; }
pre { background: inherit; border: none; padding: 0.2em; margin: 0.2em auto; display:table; }
h2 { color: darkblue; font-size: 1.1em; line-height: 1.1em; text-align: center; margin: 0.2em auto; }

/* this rule is needed twice for some reason */
p.verse b { color: darkgreen !important; }
p.verse b { color: darkgreen; }
p.verse span.underline { color: maroon !important; }  /* font-weight: 550; */
/* p.verse b { color: darkgreen; } */
p.verse { font-family: monospace; line-height: 0.7em; padding: 0; margin: 0.2em}; }
#+end_src

** Options

ughh

#+begin_example shell
uv__add) -r -c -m -i -f -U -P -C -p --requirements --constraints --marker --dev --optional --group --editable --no-editable --raw --bounds --rev --tag --branch --lfs --extra --no-sync --locked --frozen --active --no-active --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --reinstall --no-reinstall --reinstall-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --compile-bytecode --no-compile-bytecode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package --refresh --no-refresh --refresh-package --package --script --python --workspace --no-workspace --no-install-project --only-install-project --no-install-workspace --only-install-workspace --no-install-local --only-install-local --no-install-package --only-install-package [PACKAGES]... 
uv__auth) login logout token dir 
uv__auth__dir) [SERVICE] 
uv__auth__login) -u -t --username --password --token --keyring-provider <SERVICE> 
uv__auth__logout) -u --username --keyring-provider <SERVICE> 
uv__auth__token) -u --username --keyring-provider <SERVICE> 
uv__build) -o -b -p -i -f -U -P -C --package --all-packages --out-dir --sdist --wheel --list --build-logs --no-build-logs --force-pep517 --clear --create-gitignore --no-create-gitignore --build-constraints --require-hashes --no-require-hashes --verify-hashes --no-verify-hashes --python --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package --refresh --no-refresh --refresh-package [SRC] 
uv__build__backend) build-sdist build-wheel build-editable get-requires-for-build-sdist get-requires-for-build-wheel prepare-metadata-for-build-wheel get-requires-for-build-editable prepare-metadata-for-build-editable 
uv__build__backend__build__editable) --metadata-directory <WHEEL_DIRECTORY> 
uv__build__backend__build__sdist) <SDIST_DIRECTORY> 
uv__build__backend__build__wheel) --metadata-directory <WHEEL_DIRECTORY> 
uv__build__backend__get__requires__for__build__editable) 
uv__build__backend__get__requires__for__build__sdist) 
uv__build__backend__get__requires__for__build__wheel) 
uv__build__backend__prepare__metadata__for__build__editable) <WHEEL_DIRECTORY> 
uv__build__backend__prepare__metadata__for__build__wheel) <WHEEL_DIRECTORY> 
uv__cache) clean prune dir size 
uv__cache__clean) --force [PACKAGE]... 
uv__cache__dir) 
uv__cache__prune) --ci --force 
uv__cache__size) --human 
uv__clean) --force [PACKAGE]... 
uv__export) -o -i -f -U -P -C -p --format --all-packages --package --prune --extra --all-extras --no-extra --no-all-extras --dev --no-dev --only-dev --group --no-group --no-default-groups --only-group --all-groups --no-annotate --annotate --no-header --header --editable --no-editable --hashes --no-hashes --output-file --no-emit-project --only-emit-project --no-emit-workspace --only-emit-workspace --no-emit-local --only-emit-local --no-emit-package --only-emit-package --locked --frozen --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package --refresh --no-refresh --refresh-package --script --python 
uv__format) --check --diff --no-project [EXTRA_ARGS]... 
uv__generate__shell__completion) bash elvish fish nushell powershell zsh 
uv__help) --no-pager [COMMAND]... 
uv__init) -p --name --bare --virtual --package --no-package --app --lib --script --description --no-description --vcs --build-backend --backend --no-readme --author-from --no-pin-python --pin-python --no-workspace --python [PATH] 
uv__lock) -i -f -U -P -C -p --check --locked --check-exists --dry-run --script --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package --refresh --no-refresh --refresh-package --python 
uv__pip) compile sync install uninstall freeze list show tree check 
uv__pip__check) -p --python --system --no-system --python-version --python-platform 
uv__pip__compile) -c -b -i -f -U -P -C -o -p --constraints --overrides --excludes --build-constraints --extra --all-extras --no-all-extras --group --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --no-sources --refresh --no-refresh --refresh-package --no-deps --deps --output-file --format --no-strip-extras --strip-extras --no-strip-markers --strip-markers --no-annotate --annotate --no-header --header --annotation-style --custom-compile-command --python --system --no-system --generate-hashes --no-generate-hashes --no-build --build --no-binary --only-binary --python-version --python-platform --universal --no-universal --no-emit-package --emit-index-url --no-emit-index-url --emit-find-links --no-emit-find-links --emit-build-options --no-emit-build-options --emit-marker-expression --no-emit-marker-expression --emit-index-annotation --no-emit-index-annotation --torch-backend --allow-unsafe --no-allow-unsafe --reuse-hashes --no-reuse-hashes --resolver --max-rounds --cert --client-cert --emit-trusted-host --no-emit-trusted-host --config --emit-options --no-emit-options --pip-args [SRC_FILE]... 
uv__pip__freeze) -p --exclude-editable --strict --no-strict --python --path --system --no-system --disable-pip-version-check 
uv__pip__install) -r -e -c -b -i -f -U -P -C -p --requirements --editable --constraints --overrides --excludes --build-constraints --extra --all-extras --no-all-extras --group --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --reinstall --no-reinstall --reinstall-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --compile-bytecode --no-compile-bytecode --no-sources --refresh --no-refresh --refresh-package --no-deps --deps --require-hashes --no-require-hashes --verify-hashes --no-verify-hashes --python --system --no-system --break-system-packages --no-break-system-packages --target --prefix --no-build --build --no-binary --only-binary --python-version --python-platform --inexact --exact --strict --no-strict --dry-run --torch-backend --disable-pip-version-check --user [PACKAGE]... 
uv__pip__list) -e -i -f -p --editable --exclude-editable --exclude --format --outdated --no-outdated --strict --no-strict --index --default-index --index-url --extra-index-url --find-links --no-index --index-strategy --keyring-provider --exclude-newer --python --system --no-system --disable-pip-version-check 
uv__pip__show) -f -p --strict --no-strict --files --python --system --no-system --disable-pip-version-check [PACKAGE]... 
uv__pip__sync) -c -b -i -f -C -p -a --constraints --build-constraints --extra --all-extras --no-all-extras --group --index --default-index --index-url --extra-index-url --find-links --no-index --reinstall --no-reinstall --reinstall-package --index-strategy --keyring-provider --config-setting --config-settings-package --no-build-isolation --build-isolation --exclude-newer --exclude-newer-package --link-mode --compile-bytecode --no-compile-bytecode --no-sources --refresh --no-refresh --refresh-package --require-hashes --no-require-hashes --verify-hashes --no-verify-hashes --python --system --no-system --break-system-packages --no-break-system-packages --target --prefix --no-build --build --no-binary --only-binary --allow-empty-requirements --no-allow-empty-requirements --python-version --python-platform --strict --no-strict --dry-run --torch-backend --ask --python-executable --user --cert --client-cert --config --pip-args <SRC_FILE>... 
uv__pip__tree) -d -i -f -p --show-version-specifiers --depth --prune --package --no-dedupe --invert --outdated --show-sizes --strict --no-strict --index --default-index --index-url --extra-index-url --find-links --no-index --index-strategy --keyring-provider --exclude-newer --python --system --no-system --disable-pip-version-check 
uv__pip__uninstall) -r -p --requirements --python --keyring-provider --system --no-system --break-system-packages --no-break-system-packages --target --prefix --dry-run --disable-pip-version-check [PACKAGE]... 
uv__publish) -u -p -t --index --username --password --token --trusted-publishing --keyring-provider --publish-url --check-url --skip-existing --dry-run --no-attestations [FILES]... 
uv__python) list install upgrade find pin dir uninstall update-shell 
uv__python__dir) --bin 
uv__python__find) --no-project --system --no-system --script --show-version --python-downloads-json-url [REQUEST] 
uv__python__install) -i -r -f -U --install-dir --bin --no-bin --registry --no-registry --mirror --pypy-mirror --python-downloads-json-url --reinstall --force --upgrade --default [TARGETS]... 
uv__python__list) --all-versions --all-platforms --all-arches --only-installed --only-downloads --show-urls --output-format --python-downloads-json-url [REQUEST] 
uv__python__pin) --resolved --no-resolved --no-project --global --rm [REQUEST] 
uv__python__uninstall) -i --install-dir --all <TARGETS>... 
uv__python__update__shell) 
uv__python__upgrade) -i -r --install-dir --mirror --pypy-mirror --reinstall --python-downloads-json-url [TARGETS]... 
uv__remove) -i -f -U -P -C -p --dev --optional --group --no-sync --active --no-active --locked --frozen --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --reinstall --no-reinstall --reinstall-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --compile-bytecode --no-compile-bytecode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package --refresh --no-refresh --refresh-package --package --script --python <PACKAGES>... 
uv__run) -m -w -s -i -f -U -P -C -p --extra --all-extras --no-extra --no-all-extras --dev --no-dev --group --no-group --no-default-groups --only-group --all-groups --module --only-dev --editable --no-editable --inexact --exact --env-file --no-env-file --with --with-editable --with-requirements --active --no-active --no-sync --locked --frozen --script --gui-script --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --reinstall --no-reinstall --reinstall-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --compile-bytecode --no-compile-bytecode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package --refresh --no-refresh --refresh-package --all-packages --package --no-project --python --show-resolution --max-recursion-depth --python-platform 
uv__self) update version 
uv__self__update) --token --dry-run [TARGET_VERSION] 
uv__self__version) --short --output-format 
uv__sync) -i -f -U -P -C -p --extra --output-format --all-extras --no-extra --no-all-extras --dev --no-dev --only-dev --group --no-group --no-default-groups --only-group --all-groups --editable --no-editable --inexact --exact --active --no-active --no-install-project --only-install-project --no-install-workspace --only-install-workspace --no-install-local --only-install-local --no-install-package --only-install-package --locked --frozen --dry-run --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --reinstall --no-reinstall --reinstall-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --compile-bytecode --no-compile-bytecode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package --refresh --no-refresh --refresh-package --all-packages --package --script --python --python-platform --check --no-check 
uv__tool) run uvx install upgrade list uninstall update-shell dir 
uv__tool__dir) --bin 
uv__tool__install) -w -e -c -b -i -f -U -P -C -p --from --with --with-requirements --editable --with-editable --with-executables-from --constraints --overrides --excludes --build-constraints --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --reinstall --no-reinstall --reinstall-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --compile-bytecode --no-compile-bytecode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package --refresh --no-refresh --refresh-package --force --lfs --python --python-platform <PACKAGE> 
uv__tool__list) --show-paths --show-version-specifiers --show-with --show-extras --show-python 
uv__tool__run) -w -c -b -i -f -U -P -C -p --from --with --with-editable --with-requirements --constraints --build-constraints --overrides --env-file --no-env-file --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --reinstall --no-reinstall --reinstall-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --compile-bytecode --no-compile-bytecode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package --refresh --no-refresh --refresh-package --lfs --python --show-resolution --python-platform --generate-shell-completion 
uv__tool__uninstall) --all <NAME>... 
uv__tool__update__shell) 
uv__tool__upgrade) -p -U -P -i -f -C --all --python --python-platform --upgrade --upgrade-package --index --default-index --index-url --extra-index-url --find-links --no-index --reinstall --no-reinstall --reinstall-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-setting-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --compile-bytecode --no-compile-bytecode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package <NAME>... 
uv__tool__uvx) -w -c -b -i -f -U -P -C -p --from --with --with-editable --with-requirements --constraints --build-constraints --overrides --env-file --no-env-file --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --reinstall --no-reinstall --reinstall-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --compile-bytecode --no-compile-bytecode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package --refresh --no-refresh --refresh-package --lfs --python --show-resolution --python-platform --generate-shell-completion 
uv__tree) -d -i -f -U -P -C -p --universal --depth --prune --package --no-dedupe --invert --outdated --show-sizes --dev --only-dev --no-dev --group --no-group --no-default-groups --only-group --all-groups --locked --frozen --no-build --build --no-build-package --no-binary --binary --no-binary-package --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --no-sources --script --python-version --python-platform --python 
uv__venv) -p -c -i -f --python --system --no-system --no-project --seed --clear --no-clear --allow-existing --prompt --system-site-packages --relocatable --index --default-index --index-url --extra-index-url --find-links --no-index --index-strategy --keyring-provider --exclude-newer --exclude-newer-package --link-mode --refresh --no-refresh --refresh-package --no-seed --no-pip --no-setuptools --no-wheel [PATH] 
uv__version) -i -f -U -P -C -p --bump --dry-run --short --output-format --no-sync --active --no-active --locked --frozen --index --default-index --index-url --extra-index-url --find-links --no-index --upgrade --no-upgrade --upgrade-package --reinstall --no-reinstall --reinstall-package --index-strategy --keyring-provider --resolution --prerelease --pre --fork-strategy --config-setting --config-settings-package --no-build-isolation --no-build-isolation-package --build-isolation --exclude-newer --exclude-newer-package --link-mode --compile-bytecode --no-compile-bytecode --no-sources --no-build --build --no-build-package --no-binary --binary --no-binary-package --refresh --no-refresh --refresh-package --package --python [VALUE] 
uv__workspace) metadata dir list 
uv__workspace__dir) --package 
uv__workspace__list) --paths uv__workspace__metadata)
#+end_example

** misc

#+name: uv-subcmd
| auth   | version | format | build         | self                      |
| run    | sync    | tool   | publish       | clean                     |
| init   | lock    | python | workspace     | generate-shell-completion |
| add    | export  | pip    | build-backend | help                      |
| remove | tree    | venv   | cache         |                           |
